RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Source/IAR/svd/HC32F460.svd
                <register>
                    <name>PEVNTDIRR4</name>
                    <description>desc PEVNTDIRR4</description>
                    <addressOffset>0x154</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PDIR</name>
                            <description>desc PDIR</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTIDR4</name>
                    <description>desc PEVNTIDR4</description>
                    <addressOffset>0x158</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTODR4</name>
                    <description>desc PEVNTODR4</description>
                    <addressOffset>0x15C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTORR4</name>
                    <description>desc PEVNTORR4</description>
                    <addressOffset>0x160</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POR</name>
                            <description>desc POR</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTOSR4</name>
                    <description>desc PEVNTOSR4</description>
                    <addressOffset>0x164</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POS</name>
                            <description>desc POS</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTRISR4</name>
                    <description>desc PEVNTRISR4</description>
                    <addressOffset>0x168</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RIS</name>
                            <description>desc RIS</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTFALR4</name>
                    <description>desc PEVNTFALR4</description>
                    <addressOffset>0x16C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FAL</name>
                            <description>desc FAL</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTNFCR</name>
                    <description>desc PEVNTNFCR</description>
                    <addressOffset>0x170</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7070707</resetMask>
                    <fields>
                        <field>
                            <name>NFEN1</name>
                            <description>desc NFEN1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIVS1</name>
                            <description>desc DIVS1</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN2</name>
                            <description>desc NFEN2</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIVS2</name>
                            <description>desc DIVS2</description>
                            <msb>10</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN3</name>
                            <description>desc NFEN3</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIVS3</name>
                            <description>desc DIVS3</description>
                            <msb>18</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN4</name>
                            <description>desc NFEN4</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIVS4</name>
                            <description>desc DIVS4</description>
                            <msb>26</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
