RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Source/IAR/svd/HC32F460.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>OTS</name>
            <description>desc OTS</description>
            <baseAddress>0x4004A400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xC</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CTL</name>
                    <description>desc CTL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>OTSST</name>
                            <description>desc OTSST</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTSCK</name>
                            <description>desc OTSCK</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTSIE</name>
                            <description>desc OTSIE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSSTP</name>
                            <description>desc TSSTP</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DR1</name>
                    <description>desc DR1</description>
                    <addressOffset>0x2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR2</name>
                    <description>desc DR2</description>
                    <addressOffset>0x4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>ECR</name>
                    <description>desc ECR</description>
                    <addressOffset>0x6</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>PERIC</name>
            <description>desc PERIC</description>
            <baseAddress>0x40055400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x8</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>USBFS_SYCTLREG</name>
                    <description>desc USBFS_SYCTLREG</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>DFB</name>
                            <description>desc DFB</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOFEN</name>
                            <description>desc SOFEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SDIOC_SYCTLREG</name>
                    <description>desc SDIOC_SYCTLREG</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xA</resetMask>
                    <fields>
                        <field>
                            <name>SELMMC1</name>
                            <description>desc SELMMC1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SELMMC2</name>
                            <description>desc SELMMC2</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>PWC</name>
            <description>desc PWC</description>
            <baseAddress>0x40048000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xC42C</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>FCG0</name>
                    <description>desc FCG0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFAEE</resetValue>
                    <resetMask>0x8FF3C511</resetMask>
                    <fields>
                        <field>
                            <name>SRAMH</name>
                            <description>desc SRAMH</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM12</name>
                            <description>desc SRAM12</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAM3</name>
                            <description>desc SRAM3</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRAMRET</name>
                            <description>desc SRAMRET</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMA1</name>
                            <description>desc DMA1</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMA2</name>
                            <description>desc DMA2</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCM</name>
                            <description>desc FCM</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AOS</name>
                            <description>desc AOS</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AES</name>
                            <description>desc AES</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HASH</name>
                            <description>desc HASH</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRNG</name>
                            <description>desc TRNG</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CRC</name>
                            <description>desc CRC</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DCU1</name>
                            <description>desc DCU1</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DCU2</name>
                            <description>desc DCU2</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DCU3</name>
                            <description>desc DCU3</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DCU4</name>
                            <description>desc DCU4</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>KEY</name>
                            <description>desc KEY</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCG1</name>
                    <description>desc FCG1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xF0FFD79</resetMask>
                    <fields>
                        <field>
                            <name>CAN</name>
                            <description>desc CAN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>QSPI</name>
                            <description>desc QSPI</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C1</name>
                            <description>desc I2C1</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C2</name>
                            <description>desc I2C2</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C3</name>
                            <description>desc I2C3</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBFS</name>
                            <description>desc USBFS</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDIOC1</name>
                            <description>desc SDIOC1</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDIOC2</name>
                            <description>desc SDIOC2</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2S1</name>
                            <description>desc I2S1</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2S2</name>
                            <description>desc I2S2</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2S3</name>
                            <description>desc I2S3</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2S4</name>
                            <description>desc I2S4</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI1</name>
                            <description>desc SPI1</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI2</name>
                            <description>desc SPI2</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI3</name>
                            <description>desc SPI3</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI4</name>
                            <description>desc SPI4</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART1</name>
                            <description>desc USART1</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART2</name>
                            <description>desc USART2</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART3</name>
                            <description>desc USART3</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART4</name>
                            <description>desc USART4</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
