RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Source/IAR/svd/HC32F460.svd
                <register>
                    <name>PWRC2</name>
                    <description>desc PWRC2</description>
                    <addressOffset>0xC402</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>DDAS</name>
                            <description>desc DDAS</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DVS</name>
                            <description>desc DVS</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWRC3</name>
                    <description>desc PWRC3</description>
                    <addressOffset>0xC403</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x7</resetValue>
                    <resetMask>0x4</resetMask>
                    <fields>
                        <field>
                            <name>PDTS</name>
                            <description>desc PDTS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDWKE0</name>
                    <description>desc PDWKE0</description>
                    <addressOffset>0xC404</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>WKE00</name>
                            <description>desc WKE00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKE01</name>
                            <description>desc WKE01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKE02</name>
                            <description>desc WKE02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKE03</name>
                            <description>desc WKE03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKE10</name>
                            <description>desc WKE10</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKE11</name>
                            <description>desc WKE11</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKE12</name>
                            <description>desc WKE12</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKE13</name>
                            <description>desc WKE13</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDWKE1</name>
                    <description>desc PDWKE1</description>
                    <addressOffset>0xC405</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>WKE20</name>
                            <description>desc WKE20</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKE21</name>
                            <description>desc WKE21</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKE22</name>
                            <description>desc WKE22</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKE23</name>
                            <description>desc WKE23</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKE30</name>
                            <description>desc WKE30</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKE31</name>
                            <description>desc WKE31</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKE32</name>
                            <description>desc WKE32</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKE33</name>
                            <description>desc WKE33</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDWKE2</name>
                    <description>desc PDWKE2</description>
                    <addressOffset>0xC406</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB7</resetMask>
                    <fields>
                        <field>
                            <name>VD1WKE</name>
                            <description>desc VD1WKE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VD2WKE</name>
                            <description>desc VD2WKE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NMIWKE</name>
                            <description>desc NMIWKE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTCPRDWKE</name>
                            <description>desc RTCPRDWKE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTCALMWKE</name>
                            <description>desc RTCALMWKE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKTMWKE</name>
                            <description>desc WKTMWKE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDWKES</name>
                    <description>desc PDWKES</description>
                    <addressOffset>0xC407</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>WK0EGS</name>
                            <description>desc WK0EGS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WK1EGS</name>
                            <description>desc WK1EGS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WK2EGS</name>
                            <description>desc WK2EGS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WK3EGS</name>
                            <description>desc WK3EGS</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VD1EGS</name>
                            <description>desc VD1EGS</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VD2EGS</name>
                            <description>desc VD2EGS</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NMIEGS</name>
                            <description>desc NMIEGS</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDWKF0</name>
                    <description>desc PDWKF0</description>
                    <addressOffset>0xC408</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>PTWK0F</name>
                            <description>desc PTWK0F</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PTWK1F</name>
                            <description>desc PTWK1F</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PTWK2F</name>
                            <description>desc PTWK2F</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PTWK3F</name>
                            <description>desc PTWK3F</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VD1WKF</name>
                            <description>desc VD1WKF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VD2WKF</name>
                            <description>desc VD2WKF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NMIWKF</name>
                            <description>desc NMIWKF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDWKF1</name>
                    <description>desc PDWKF1</description>
                    <addressOffset>0xC409</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB8</resetMask>
                    <fields>
                        <field>
                            <name>RTCPRDWKF</name>
                            <description>desc RTCPRDWKF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTCALMWKF</name>
                            <description>desc RTCALMWKF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKTMWKF</name>
                            <description>desc WKTMWKF</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWCMR</name>
                    <description>desc PWCMR</description>
                    <addressOffset>0xC40A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x80</resetMask>
                    <fields>
                        <field>
                            <name>ADBUFE</name>
                            <description>desc ADBUFE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MDSWCR</name>
                    <description>desc MDSWCR</description>
                    <addressOffset>0xC40F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>PVDCR0</name>
                    <description>desc PVDCR0</description>
                    <addressOffset>0xC412</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x61</resetMask>
                    <fields>
                        <field>
                            <name>EXVCCINEN</name>
                            <description>desc EXVCCINEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1EN</name>
                            <description>desc PVD1EN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2EN</name>
                            <description>desc PVD2EN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PVDCR1</name>
                    <description>desc PVDCR1</description>
                    <addressOffset>0xC413</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x77</resetMask>
                    <fields>
                        <field>
                            <name>PVD1IRE</name>
                            <description>desc PVD1IRE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1IRS</name>
                            <description>desc PVD1IRS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1CMPOE</name>
                            <description>desc PVD1CMPOE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2IRE</name>
                            <description>desc PVD2IRE</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2IRS</name>
                            <description>desc PVD2IRS</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2CMPOE</name>
                            <description>desc PVD2CMPOE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PVDFCR</name>
                    <description>desc PVDFCR</description>
                    <addressOffset>0xC414</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x11</resetValue>
                    <resetMask>0x77</resetMask>
                    <fields>
                        <field>
                            <name>PVD1NFDIS</name>
                            <description>desc PVD1NFDIS</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1NFCKS</name>
                            <description>desc PVD1NFCKS</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2NFDIS</name>
                            <description>desc PVD2NFDIS</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2NFCKS</name>
                            <description>desc PVD2NFCKS</description>
                            <msb>6</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
